package day0430;
//자바의 명명 규칙
//1. 공통규칙
//A. 자바는 대소문자를 엄격히 구분한다.
//B. 이름을 지을 때에는 이름 안에는 _를 제외한 특수 문자를 넣을 수 없다.
//C. 이름 중간이나 끝에 숫자가 나올 수 있지만 시작할 때에는 숫자를 넣을 수 없다.
//D. 자바에서는 내부적으러 중요하게 사용되는 50 여가지의 예약어가 존재하고 해당하는 이름으로는 이름을 지을 수 없다.
//2. 낙타등 표기법
//낙타등 표기법은 대소문자를 같이 사요ㅕㅇ할 떄에 여러 단어로 이루어질 경우 두번째 단어부터는 첫글자를 대문자로 적어주는 방법이다.
//3. 뱁 표기법
//뱀 표기법은 모든 단어를 대문자로 나타낼 때에 단어 사이에 _를 넣는 방법이다.
//4. 종류에 따른 이름 짓기
//A. 클래스 : 첫글자를 대문자로 시작하고 낙타등 표기법을 사용하는 명사
//B. 패키지 : 첫글자를 소문자로 시작하고 해당 패키지 안에 클래스들의 성격을 잘 나타내는 한 단어의 명사
//C. 변수 : 첫글자를 소문자로 시작하고 낙타등 표기법을 사용하는 명사
//D. 상수 : 뱀 표기법을 사용하는 명사
//E. 메소드 : 첫글자를 소문자로 시작하는 낙타등 표기법을 사용하는 동사
public class Ex03Notation {
}
