package day0501;

public class Homework01 {
    // 1. 사용자로부터 숫자를 입력받아서
    //    양의 정수이면 "양의 정수입니다" 가 출력되는
    //    코드를 작성하시오.
    // 2. 사용자로부터 나이를 입력받아서
    //    미성년자일 경우 "미성년자입니다" 가 출력되는
    //    코드를 작성하시오.
    // 3. 사용자로부터 국어, 영어, 수학 점수를 입력받아서
    //    평균이 60점 이상이고, 모든 과목이 50점 초과일때
    //    합격입니다. 가 출력되는 코드를 작성하시오
    // 4. 사용자로부터 아이디와 비밀번호를 입력받아서
    //    아이디가 "admin", 비밀번호가 "!Q@W3e4r" 일 경우
    //    "로그인 성공" 이 출력되는 코드를 작성하시오
    // 5. 사용자가 숫자를 입력했을 때
    //    0~100 사이의 숫자가 입력됬을 경우
    //    "올바른 시험 점수입니다" 가 출력되는 코드를 작성하시오

}
